Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: В коллекции содержится более одного элемента с именем %s
en: The collection contains more than one item with %s name

source: Получение производного элемента конфигурации по индексу не поддерживается
en: Getting derived configuration item by index not supported

source: Получение количества производных элементов конфигурации не поддерживается
en: Getting derived item count of the configuration not supported

source: При чтении атомарного элемента конфигурации %s будет произведено конвертирование
en: When reading the atomic element of %s configuration, converting will be performed

source: Не удалось считать значение атрибута "%s"
en: Failed to read the value of attribute "%s"

source: Строка "%s" не может быть преобразована в значение типа "символ"
en: "%s" string cannot be converted to the "character" value

source: Ошибка разбора XML: сообщение "%s", строка %d, столбец %d
en: XML parsing error: message "%s", row %d, column %d

source: Для элемента "%0:s" невозможно определить соответствующий схеме сиблинг "%1:s{%2:s}"
en: It is not possible to define "%1:s{%2:s}" sibling corresponding the schema for "%0:s" element

source: Связанный тип схемы конфигурации для типа %s не найден
en: Binded configuration schema type for %s type not found

source: Тип схемы конфигурации %s уже добавлен к схеме
en: %s configuration schema type has already been added to the schema

source: Неподдерживаемый тип свойства
en: Unsupported property type

source: Не удалось загрузить некоторые элементы конфигурации
en: Failed to load some configuration elements

source: Метод разбиения не реализован
en: Partition method not implemented

source: Не выбрано ни одного поля, определяющего страту.
en: No fields have been selected that define the stratum.

source: Не задан метод сэмплинга
en: No sampling method specified

source: Для элемента "%0:s" невозможно определить соответствующий схеме подэлемент "%1:s{%2:s}"
en: It is not possible to define "%1:s{%2:s}" subelement corresponding the schema for "%0:s" element

source: Количество выбранных строк %d вне диапазона [%d, %d]
en: The selected row count %d is out of range [%d, %d]

source: Процент выбранных строк %d вне диапазона [%d, %d]
en: The selected row percentage %d is out of range [%d, %d]

source: Случайный сэмплинг
en: Random sampling

source: Групповой сэмплинг
en: Group sampling

source: Последовательный сэмплинг
en: Sequence sampling

source: Стратифицированный сэмплинг
en: Stratified sampling

source: Формирование обучающего множества
en: Selecting the training set

source: Формирование тестового множества
en: Selecting the test set

source: Столбец внешнего разбиения не задан
en: No external partition column specified

source: Ошибка при разборе XML. Строка: %d. Позиция: %d. Код ошибки: %d. Сообщение: %s
en: Error parsing XML. Line: %d. Column: %d. Error code: %d. Message: %s

source: Сэмплинг методом отбора со смещением
en: Biased sampling

source: Интерквантильное разделение
en: Calculating quantiles

source: Ошибка валидации XML. Строка: %d. Позиция: %d. Код ошибки: %d. Сообщение: %s
en: XML validation error. Line: %d. Column: %d. Error code: %d. Message: %s

source: Описания столбцов
en: Column definitions

source: СУБД ClickHouse
en: ClickHouse DBMS

source: СУБД MS Access (ODBC)
en: MS Access (ODBC) DBMS

source: Файл MS Excel (ODBC)
en: MS Excel File (ODBC)

source: СУБД Firebird
en: Firebird DBMS

source: СУБД InterBase
en: InterBase DBMS

source: СУБД MS SQL (OLE DB)
en: MS SQL (OLE DB) DBMS

source: СУБД MySQL
en: MySQL DBMS

source: ODBC-драйвер доступа к данным
en: ODBC data access driver

source: СУБД Oracle
en: Oracle DBMS

source: Не задано ни одно элемента в XML-документе для выполнения экспорта
en: No elements were specified in XML document for export

source: СУБД PostgreSQL
en: PostgreSQL DBMS

source: БД SQLite
en: SQLite DB

source: Имя файла не может быть пустым
en: File name cannot be empty

source: Папка с файлами
en: Folder with files

source: Не удалось подготовить имена файлов
en: Failed to prepare file names

source: Файловое хранилище не задано
en: File storage not specified

source: Ошибка при экспорте строки #%d входного набора: %s
en: Error exporting row #%d of the input dataset: %s

source: Время модификации
en: File time

source: Не указан пароль
en: Password not specified

source: Не указано имя пользователя
en: Username not specified

source: Не удалось подключится к кластеру Kafka %s: %s
en: Failed to connect to Kafka %s cluster: %s

source: Не указан кластер Kafka
en: No Kafka cluster specified

source: Не задана процедура связывания контекста и приемника экспорта
en: No context coupling procedure and export recipient specified

source: Подключение к Kafka
en: Kafka connector

source: Не удалось создать Consumer: %s
en: Failed to create Consumer - %s

source: Не удалось создать Producer: %s
en: Failed to create Producer - %s

source: Ошибка Kafka: "%s", причина: "%s"
en: Kafka error: "%s", reason: "%s"

source: База
en: Base

source: Ошибка libxml2 (код %d): %s
en: libxml2 error (code %d): %s

source: Нераспознанная ошибка libxml2
en: Unknown error libxml2

source: Не задан приемник экспорта
en: Export destination not specified

source: Ошибка при разборе XML (строка %d, позиция %d): %s
en: Error parsing XML (line %d, position %d): %s

source: Ошибка при разборе XML по адресу "%s" (строка %d, позиция %d): %s
en: Error parsing XML at address "%s" (line %d, position %d): %s

source: Библиотека %s не найдена
en: %s library not found

source: Не найдена библиотека libsystemd.so
en: libsystemd.so library not found

source: Не удалось применить параметры логирования
en: Failed to use logging parameters

source: Все #
en: All #

source: Данные содержат пустые значения
en: Data contains null values

source: В процедуру PrepareLagMatrix переданы некорректные данные
en: Incorrect data passed to PrepareLagMatrix procedure

source: Невозможно вычислить обратную матрицу: определитель равен нулю.
en: It is impossible to calculate the inverse matrix: determinant is zero.

source: Выбор #
en: Choice #

source: Ошибка при создании разреженного солвера с типом: %s
en: Error creating sparse solver with type: %s

source: Матрица или правая часть не заданы
en: Matrix or right side not set

source: Солвер SuperLU пока не поддерживает неквадратные матрицы
en: Solver SuperLU does not support non-square matrices yet

source: Количество столбцов матрицы и размерность правой части/решения не совпадают
en: The matrix column count and dimension of the right part/solution do not match

source: Процедура солвера SuperLU завершилась с ошибкой
en: SuperLU Solver procedure failed

source: Матрица не преобразована к формату SuperLU
en: Matrix not converted to SuperLU format

source: Неподдерживаемый тип массива: %s
en: Unsupported array type: %s

source: Неподдерживаемый тип матрицы: %s
en: Unsupported matrix type: %s

source: Недопустимые координаты для создания линейной функции
en: Invalid coordinates to create linear function

source: Неизвестный тип разреженного солвера: %s
en: Unknown sparse solver type: %s

source: Последовательность #
en: Sequence #

source: Неверный тип сплайна для алгоритма %s: %s
en: Invalid spline type for %s: %s algorithm

source: Ошибка солвера %d при расчете сезонных индексов
en: Solver error %d when calculating seasonal indices

source: Ошибка %d процедуры расчета сглаживающего сплайна при построении тренда
en: Error %d of the smoothing spline calculation procedure during trend building

source: Точки данных для расчета сезонных индексов должны лежать в пределах [0; Период)
en: Data points for seasonal indexes calculation must be within the following limits [0; Period)

source: Процедура расчета тренда вызвана без задания параметров сглаживания
en: The trend calculation procedure was called without specifying smoothing parameters

source: Массивы имеют разную длину %d и %d
en: Arrays have different lengths: %d and %d

source: Заданное количество корзин %d меньше 2
en: The specified bin count %d is less than 2

source: Значение вероятности %f вне диапазона [0;1]
en: Probability value %f is out of range [0;1]

source: Для атрибута %s не указано обязательное значение
en: No required value for %s attribute

source: Индекс строки
en: Row index

source: Входной и выходной порты несовместимы
en: Input and output ports are incompatible

source: Интерфейс %s не поддерживается
en: %s interface not supported

source: Выполнение запрещено
en: Execution forbidden

source: Для установки настройки "%s" передано значение несовместимого типа
en: Value of incompatible type was passed to "%s" setting

source: Настройка "%s" не существует
en: "%s" setting does not exist

source: Настройки уже проинициализированы
en: Settings already initialized

source: Тестирование уже выполняется
en: Testing is already in progress

source: вендор подключений
en: connection vendor

source: группа вендоров подключений
en: connection vendor group

source: Для элемента %s не указано обязательное значение
en: No required value for %s element

source: Бизнес-приложения
en: Business Applications

source: Базы данных
en: Databases

source: Файловые базы данных
en: File Databases

source: Универсальные драйверы
en: Universal Drivers

source: Хранилища данных
en: Data Warehouses

source: Вендор подключения должен принадлежать хотя бы одной группе
en: Connection vendor must belong to at least one group

source: Подключение "%s" не принадлежит текущему списку подключений
en: "%s" connection does not belong to the current connection list

source: Узел "%s" не является ссылкой на подключение
en: "%s" node is not a connection reference

source: Имя узла дерева не может быть пустым
en: Tree node name cannot be empty

source: Узел "%s" не проинициализирован
en: "%s" node not initialized

source: Узел "%s" не ссылается ни на одно подключение
en: "%s" node does not refer to any connections

source: Узел подключения "%s" заменен производным узлом
en: "%s" Connection Node Replaced by Derived Node

source: Источник данных
en: Data source

source: Входной источник данных
en: Input data source

source: Недопустимый путь узла: %s
en: Invalid node path: %s

source: Превышено максимально допустимое количество узлов дерева (%d)
en: Maximum allowable number of (%d) tree nodes exceeded

source: При параллельном импорте возникла ошибка
en: Error importing in parallel

source: Поле "%s" не принадлежит текущему компоненту
en: "%s" field does not belong to the current component

source: Регистрация выделения узлов уже включена
en: Node selection registering already on

source: Выходное дерево данных
en: Output data tree

source: Не удалось обновить конфигурацию производной подмодели перед активацией. Использована неподдерживаемая конфигурация зависимости узлов.
en: Failed to update configuration of the derived supernode before activation. Unsupported configuration of nodes dependence was used.

source: Не удалось обновить конфигурацию производной подмодели перед активацией. Попробуйте обновить конфигурацию текущей подмодели вручную.
en: Failed to update configuration of the derived supernode before activation. Try to update configuration of the current supernode manually.

source: Базовый компонент уже существует
en: Base component already exists

source: Регистрация выделения узлов не была включена
en: Node selection registering off

source: Базовый компонент узла не проинициализирован
en: The node base component not initialized

source: У базового компонента узла не задан вендор
en: No vendor defined for the base node component

source: Не найдена конфигурация базового узла
en: Base node configuration not found

source: Базовый узел не найден
en: Base node not found

source: Циклическое наследование компонентов невозможно
en: Circular inheritance of components is not possible

source: Не найден GUID производного компонента
en: No GUID of derived component found

source: Создание производных узлов по компоненту %s не разрешено
en: Creation of derived nodes by %s component is not allowed

source: Базовый и производный компоненты не совместимы
en: Base and derived components are incompatible

source: Базовый компонент удален
en: Base component deleted

source: Базовый компонент не найден
en: Base component not found

source: Попытка установить или получить значение для узла с типом данных dtNone
en: Attempt to set or get a value for the node with dtNone data type

source: Неизвестный тип описателя соединения
en: Unknown type of the coupler definition

source: Не удалось обновить конфигурацию производного компонента "%s": базовый узел заблокирован
en: Failed to update configuration of derived component "%s": base node locked

source: Невозможно изменять имя производных портов
en: It is not possible to change the derived ports name

source: Невозможно изменять тип данных производных портов
en: It is not possible to change the derived ports data type

source: Удаление производных подключений невозможно
en: It is not possible to delete the derived connections

source: Удаление производных портов невозможно
en: It is not possible to delete the derived ports

source: Удаление производных компонентов невозможно
en: It is not possible to delete the derived components

source: В текущем контексте нельзя создать компонент фильтрации данных
en: You cannot create a data filter component in the current context

source: Не задано имя следующих входов:
en: No name of the following inputs specified:

source: Имя порта можно не задавать, только если порт является единственным
en: Port name can be unspecified only if the port is single

source: Попытка получить путь родительского узла для корневого узла дерева
en: Attempt to get the parent node path for the tree root node

source: Не задано имя следующих выходов:
en: No name of the following outputs specified:

source: Не указаны типы следующих входов:
en: The following input types are not specified:

source: Не указаны типы следующих выходов:
en: The following output types are not specified:

source: Внешние данные
en: External data

source: Внутренние узлы Подмодели заблокированы
en: Internal Supernode nodes locked

source: Подмодель уже заблокирована в рамках другой операции
en: Supernode already locked in another operation

source: Подмодель содержит заблокированные узлы
en: Supernode contains locked nodes

source: Подмодель
en: Supernode

source: Порт данного типа не поддерживает изменение флага необязательности
en: The port related to this type does not support optionality flag change

source: Внешний порт компонента уже настраивается
en: The external port component has already been configuring

source: Попытка получить путь корневого элемента схемы для корневого узла дерева
en: Attempt to get the schema root element path for the tree root node

source: Входной узел
en: Input Node

source: Выходной узел
en: Output Node

source: Позиция
en: Position

source: Ссылка на порт узла не входит в какой-либо список
en: Reference to the node port is not included into list

source: Попытка установить с помощью SetAsString значение для узла с типом данных "Дата/время"
en: Attempt to set the SetAsString based value for the "Date/time" data type node

source: Список портов узла не принадлежит какому-либо узлу
en: The node port list does not belong to any node

source: Компонент узла уже находится в состоянии настройки порта
en: The node component is in the port configuring state

source: Неверная реализация движка компонента
en: Invalid component engine implementation

source: Компонент узла уже проинициализирован
en: The node component already initialized

source: Ошибка формирования автоматической метки
en: Error generating auto-caption

source: Соединение
en: Coupler

source: Соединение уже проинициализировано
en: Coupler already initialized

source: Действие возможно только при настройке узла
en: This action is possible only when configuring the node

source: Попытка установить с помощью SetAsString значение для узла с типом данных "Переменный"
en: Attempt to set the SetAsString based value for the "Variable" data type node

source: вендор движков компонентов
en: component engine vendor

source: Движок компонента уже проинициализирован
en: The component engine already initialized

source: компонент
en: component

source: группа компонентов
en: component group

source: Сервисные узлы
en: Service Nodes

source: Программирование
en: Scripting

source: Попытка установить с помощью SetDateTimeAsString значение для узла с типом данных, отличным от "Дата/время"
en: Failed to set value via the SetDateTimeAsString function for the node with non "Date/time" data type

source: Исследование
en: Exploration

source: Экспорт
en: Export

source: Управление
en: Control

source: Импорт
en: Import

source: Интеграция
en: Integration

source: Предобработка
en: Preprocessing

source: Трансформация
en: Transformation

source: Попытка установить с помощью SetDateTimeAsString значение для узла с типом данных, отличным от "Переменный"
en: Failed to set value via the SetDateTimeAsString function for the node with non "Variant" data type

source: Входной порт уже проинициализирован
en: The input port already initialized

source: Выходной порт уже проинициализирован
en: The output port already initialized

source: Скопированы узлы
en: Nodes Copied

source: Не удалось создать копию заметки с GUID: %s
en: Failed to create annotation copy with GUID: %s

source: Невозможно переместить базовый компонент "%s" внутрь производного узла "%s".
en: Failed to move "%s" base component inside "%s" derived node.

source: Невозможно переместить производный узел "%s" внутрь базового узла "%s"
en: Failed to move "%s" derived node inside "%s" base node

source: Невозможно переместить узел "%s" внутрь самого себя
en: Failed to move "%s" node inside itself

source: Не удалось восстановить ссылку от узла "%s". Исходный узел "%s" не доступен в целевом расположении.
en: Failed to restore reference from "%s" node. "%s" source node is not available at the required destination.

source: Обнаружена циклическая зависимость узлов!
en: Circular link between nodes detected!

source: В ходе перемещения узлов возникли ошибки
en: Errors occurred while moving nodes

source: Метод EndUpdateSelection был вызван без метода BeginUpdateSelection
en: EndUpdateSelection method called without BeginUpdateSelection method

source: Порт линка с идентификатором %s не подключен к узлу
en: Link port with %s identifier not connected to node

source: Перемещённый производный компонент %s недоступен для узла %s.
en: Moved %s derived component is unavailable for %s node.

source: Не удалось создать копию узла с названием: "%s" и GUID: %s
en: Failed to create the node copy with the following name: "%s" and GUID: %s

source: Не задан набор узлов и заметок
en: Set of nodes and annotations not specified

source: Не найден исходный модуль
en: Source module not found

source: Не найден целевой модуль
en: Target module not found

source: Одна или несколько исходных заметок были удалены или перемещены
en: One or several source annotations were deleted or moved

source: Один или несколько исходных узлов были удалены или перемещены
en: One or several source nodes have been deleted or moved

source: Не удалось восстановить связь между узлами "%s" и "%s"
en: Failed to restore link between "%s" and "%s" nodes

source: Не найден производный компонент "%s". Возможно, этот компонент был удалён.
en: Derived component "%s" not found. This component could have been deleted.

source: Невозможно преобразовать строку "%s" в значение типа "%s"
en: Failed to convert "%s" string to "%s" value

source: Производный компонент %s недоступен для перемещённого узла %s.
en: %s derived component is unavailable for moved %s node.

source: Не найден производный компонент "%s", на который ссылается узел "%s". Возможно, этот компонент был удалён.
en: Derived component "%s" referenced by "%s" node not found. This component could have been deleted.

source: Операция принудительного повторного перемещения запрещена
en: Repeated forced move operation is forbidden

source: Перемещены узлы
en: Nodes Moved

source: Операция была отменена
en: Operation canceled

source: Неизвестный узел
en: Unknown node

source: Неизвестный компонент
en: Unknown component

source: Модуль не принадлежит текущему пакету
en: Node does not belong to the current package

source: Не удалось восстановить ссылку на пакет с именем %s и версией %s
en: Failed to restore the reference to the package with %s name and %s version

source: Не удалось восстановить ссылку на пакет с именем файла "%s" и версией %s. Вместо этого найден файл "%s". Возможно, в настройках ссылки на пакет неверно указан путь к файлу.
en: Failed to restore reference to the package with "%s" file name and %s version. Instead "%s" file was found. Perhaps, invalid path to the file was specified in the package reference settings.

source: Невозможно преобразовать строку "%s" в число типа "%s": %s
en: Failed to convert "%s" string to "%s" number: %s

source: Невозможно создать циклические ссылки между пакетами "%s" и "%s"
en: Circular references between packages "%s" and "%s" are not possible

source: Локаль "%s" не поддерживается системой
en: "%s" locale is not supported by the system

source: Узел %s не найден
en: Node %s not found

source: Ссылка на пакет "%s" уже существует
en: Reference to "%s" package already exists

source: В пакете нельзя добавить ссылку на самого себя
en: Package cannot have a self-reference

source: Имя пакета не может быть пустым
en: Package name cannot be empty

source: Имя пакета "%s" содержит недопустимый символ "%s"
en: "%s" package name contains the invalid "%s" character

source: Имя пакета "%s" начинается с недопустимого символа "%s"
en: "%s" package name starts with the invalid "%s" character

source: Не удалось найти пакет %s
en: Failed to find %s package

source: Ссылка на пакет с именем "%s" уже существует
en: Reference to package with name "%s" already exists

source: Индекс (%s)
en: (%s) index

source: При восстановлении ссылки на пакет с именем %s и версией %s возникли ошибки
en: Errors restoring reference to package with %s name and %s version

source: Количество имён и значений переменных должно быть одинаковым
en: Number of names and variables values must be the same

source: Переменная с именем "%s" не найдена
en: Variable with "%s" name not found

source: Значения переменных должны содержаться только в одном массиве
en: Variable values must be contained in one array only

source: Версия пакета %s изменена на %s
en: %s package version changed to %s

source: Восстановление значений переменных пакета
en: Restoring Values of Package Variables

source: Базовый пакет не найден
en: Base package not found

source: При сохранении пакета "%s" возникла ошибка. Файл восстановлен из резервной копии.
en: Error occurred while saving "%s" package. File restored from backup.

source: Сообщения при конвертировании пакета "%s"
en: Messages when converting "%s" package

source: Не получилось открыть файл
en: Failed to open file

source: При открытии пакета "%s" версии %s будет произведено конвертирование.
en: When opening "%s" package of %s version, converting will be performed.

source: Ошибка загрузки пакета: не удалось загрузить элемент "%s"
en: Package load error: failed to load "%s" element

source: Не удалось открыть файл "%s"
en: Failed to open file: "%s"

source: Текущая версия приложения не может расшифровать пакет "%s": неподдерживаемый способ шифрования пакета
en: The current application version cannot decrypt "%s" package: unsupported method of package encryption

source: Пакет "%s" был создан в более новой версии Loginom %s. В текущей версии часть функционала может работать некорректно.
en: "%s" package was created in a newer version of Loginom %s. In the current version, a part of the functionality may not work correctly.
